import json

CANON = {
    # 느림
    "느리다": "느림",
    "느리고": "느림",
    "느린데": "느림",
    "느려서": "느림",
    "느립니다": "느림",
    "느려요": "느림",

    # 빠름
    "빠르다": "빠름",
    "빠르고": "빠름",
    "빠른데": "빠름",
    "빨라서": "빠름",
    "빠릅니다": "빠름",
    "빨라요": "빠름",

    # 좋음
    "좋다": "좋음",
    "좋고": "좋음",
    "좋은데": "좋음",
    "좋아서": "좋음",
    "좋습니다": "좋음",
    "좋아요": "좋음",
    "굿": "좋음",
    # 나쁘지 않음 처리 필요
    
    # 나쁨
    "나쁘다": "나쁨",
    "나쁘고": "나쁨",
    "나쁜데": "나쁨",
    "나빠서": "나쁨",
    "나쁩니다": "나쁨",
    "나빠요": "나쁨",
    "별로다": "나쁨",
    "별로고": "나쁨",
    "별론데": "나쁨",
    "별로여서": "나쁨",
    "별로입니다": "나쁨",
    "별롭니다": "나쁨",
    "별로예요": "나쁨",
    "별로에요": "나쁨",
    "별로": "나쁨",

    # 비쌈
    "비싸다": "비쌈",
    "비싸고": "비쌈",
    "비싼데": "비쌈",
    "비싸서": "비쌈",
    "비쌉니다": "비쌈",
    "비싸요": "비쌈",

    # 쌈
    "싸다": "쌈",
    "싸고": "쌈",
    "싼데": "쌈",
    "싸서": "쌈",
    "쌉니다": "쌈",
    "싸요": "쌈",
    "저렴하다": "쌈",
    "저렴하고": "쌈",
    "저렴한데": "쌈",
    "저렴해서": "쌈",
    "가성비": "쌈",
    "가성비좋다": "쌈",

    # 불친절
    "불친절하다": "불친절",
    "불친절하고": "불친절",
    "불친절한": "불친절",
    "불친절해서": "불친절",
    "불친절함": "불친절",
    "불친절합니다": "불친절",
    "불친절해요": "불친절",
    
    # 친절
    "친절하다": "친절",
    "친절하고": "친절",
    "친절한": "친절",
    "친절해서": "친절",
    "친절함": "친절",
    "친절합니다": "친절",
    "친절해요": "친절",

    # 안됨
    "안되다": "안됨",
    "안된다": "안됨",
    "안돼다": "안됨",
    "안돼요": "안됨",
    "안됨": "안됨",
    "안되고": "안됨",
    "안되서": "안됨",
    "안돼서": "안됨",
    "안되네요": "안됨",
    "안되네요": "안됨",
    "불가": "안됨",
    "실패": "안됨",

    # 있음
    "있다": "있음",
    "있고": "있음",
    "있는": "있음",
    "있는데": "있음",
    "있어서": "있음",
    "있습니다": "있음",
    "있어요": "있음",
    "있네요": "있음",
    "있네": "있음",
    "있었어요": "있음",
    "있었다": "있음",
    "있더라": "있음",

    # 없음
    "없다": "없음",
    "없고": "없음",
    "없는": "없음",
    "없는데": "없음",
    "없어서": "없음",
    "없습니다": "없음",
    "없어요": "없음",
    "없네요": "없음",
    "없네": "없음",
    "없었어요": "없음",
    "없었다": "없음",
    "없더라": "없음",

    # 적음
    "적다": "적음",
    "적고": "적음",
    "적은데": "적음",
    "적어서": "적음",
    "적습니다": "적음",
    "적어요": "적음",
    "부족하다": "적음",
    "부족하고": "적음",
    "부족한": "적음",
    "부족해서": "적음",
    "부족함": "적음",

    # 많음
    "많다": "많음",
    "많고": "많음",
    "많은데": "많음",
    "많아서": "많음",
    "많습니다": "많음",
    "많아요": "많음"
}

with open("canon.json", "w", encoding="utf-8") as f:
    json.dump(
        CANON,
        f,
        ensure_ascii=False, # 한글 깨짐 방지
        indent=2 # 사람이 읽기 좋게
    )